---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.INavisworksExporter
source: html/46fc6dc6-b478-a39b-b7db-331ee9c05380.htm
---
# INavisworksExporter Members

The method that Revit will invoke to perform an export to Navisworks.